//=============================================================================
//
// タイトル画面処理 [bg.h]
// Author : 
//
//=============================================================================
#ifndef _BG_H_
#define _BG_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	TEXTURE_BG			_T("data/TEXTURE/star.png")			// 読み込むテクスチャファイル名

#define	BG_POS_X			(0.0f)								// タイトルの表示位置
#define	BG_POS_Y			(0.0f)								// タイトルの表示位置
#define	BG_SIZE_X		(640.0f)							// タイトルの幅
#define	BG_SIZE_Y		(480.0f)							// タイトルの高さ

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBg(int type);
void UninitBg(void);
void UpdateBg(void);
void DrawBg(void);

#endif
