//=============================================================================
//
// タイトル画面処理 [title.h]
// Author : 
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	TEXTURE_TITLE			_T("data/TEXTURE/utyuu.png")			// 読み込むテクスチャファイル名

#define	TITLE_POS_X			(0.0f)								// タイトルの表示位置
#define	TITLE_POS_Y			(0.0f)								// タイトルの表示位置
#define	TITLE_SIZE_X		(640.0f)							// タイトルの幅
#define	TITLE_SIZE_Y		(480.0f)							// タイトルの高さ

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTitle(int type);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);

#endif
